let arr = [1,2,3,4,5,6,7,8,9,0];

// 要求:反序输出数组
// 直接使用reverse方法,但是会修改原有数组
arr.reverse();
console.log(arr);
    /* [
        0, 9, 8, 7, 6,
        5, 4, 3, 2, 1 
    ] */

// 要求:使数组中的元素从小到大排序
// 如果直接使用ES6提供的sort方法,表明没有问题,那是因为里面都是只有一位的整数.
arr.sort();
console.log(arr);
    /* [
    0, 1, 2, 3, 4,
    5, 6, 7, 8, 9 
    ] */
// 因为sort的默认排序是把数组元素当做字符串来相互进行比较的.
let arr2 = [1,2,3,4,11,12,24,34].sort();
console.log(arr2);
    /* [
        1, 11, 12, 2,
        24,  3, 34, 4
        ] */
// 正常使用
// a比b大时会返回正数,a比b小时会返回负数
arr2.sort((a,b) => a - b);
console.log(arr2);
    /* [
        1,  2,  3,  4,
    11, 12, 24, 34
    ] */